# Pandas

## Series

Series 是一个类似于**一维数组**的数据结构，它由一组数据(各种NumPy数据类型，比如整数、字符串、浮点数等)和与之相关的数据标签(索引)两部分构成。

Series的字符串表现形式为：索引在左边，值在右边。默认不会对数据指定索引，于是会自动创建一个0到N-1（N为数据的长度）的整数型索引。

### Series 的创建

In [ ]:
import pandas as pd

# 使用pd.Series()常规语法创建
pd.Series(
    data= None,      # 数据
    index= None,     # 指定索引
    dtype= None      # 类型
    )

# 或者使用字典进行创建

In [2]:
# 示例
import pandas as pd
import numpy as np
pd.Series(data= np.arange(3), index=['a', 'b', 'c'])

a    0
b    1
c    2
dtype: int32

In [3]:
import pandas as pd
pd.Series({'a':100, 'b':200, 'c':300})

a    100
b    200
c    300
dtype: int64

### Series 的属性

为了更方便地操作 Series 对象中的索引和数据，**Series 中提供了两个属性 `index` 和 `values`**

In [4]:
import pandas as pd
import numpy as np
data = pd.Series(data= np.arange(3), index=['a', 'b', 'c'])
data.index

Index(['a', 'b', 'c'], dtype='object')

In [5]:
data.values

array([0, 1, 2])

通过索引获取Series数据

In [7]:
import pandas as pd
import numpy as np
data = pd.Series(data= [500, 400, 600], index=['a', 'b', 'c'])
data[['b', 'c', 'a']]     # 通过索引列表

b    400
c    600
a    500
dtype: int64

In [8]:
data[(data>200) & (data<600)] # 通过逻辑表达式

a    500
b    400
dtype: int64

修改`values` (使用NumPy函数或类似NumPy的运算)

In [9]:
np.exp(data)

a    1.403592e+217
b    5.221470e+173
c    3.773020e+260
dtype: float64

Series对象本身及其索引都有一个`name`属性，可以进行修改

In [10]:
data.index.name = '序号'
data.name = 'test'
data

序号
a    500
b    400
c    600
Name: test, dtype: int64

## DataFrame

DataFrame是一个表格型的数据结构，它含有一组有序的列，每列可以是不同的值类型（数值、字符串、布尔值等。DataFrame既有行索引也有列索引，它可以被看做由Series组成的字典（共用同一个索引。DataFrame中的数据是以一个或多个二维块存放的（而不是列表、字典或别的一维数据结构。

### DataFrame的创建

In [31]:
# 最常用的是利用pd.Dataframe()直接传入一个等长列表或NumPy数组组成的字典
import pandas as pd
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
df = pd.DataFrame(data)
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

使用嵌套字典创建数据集

In [1]:
import pandas as pd
test_data= {'place': {'2000':'Nevada', '2001': 'Lisbon'},
            'temp': {'2000': 20, '2001': 18}}
test_df = pd.DataFrame(data=test_data)
test_df

       place  temp
2000  Nevada    20
2001  Lisbon    18

### DataFrame的概览

In [14]:
df.head(2)       # 读取前n行

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7

In [15]:
df.tail(2)       # 读取后n行

    state  year  pop
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [2]:
df.values       #values以二维ndarray的形式返回DataFrame中的数据

array([['Ohio', 2000, 1.5],
       ['Ohio', 2001, 1.7],
       ['Ohio', 2002, 3.6],
       ['Nevada', 2001, 2.4],
       ['Nevada', 2002, 2.9],
       ['Nevada', 2003, 3.2]], dtype=object)

#### 根据列名重新组合数据框并读取

In [43]:
import pandas as pd
new_df = pd.DataFrame(data= df, columns= ['year', 'state', 'pop'])
new_df

   year   state  pop
0  2000    Ohio  0.0
1  2001    Ohio  1.0
2  2002    Ohio  2.0
3  2001  Nevada  3.0
4  2002  Nevada  4.0
5  2003  Nevada  5.0

#### 获取DataFrame的列（即为一个Series）

此时，返回的Series拥有原DataFrame相同的索引，且其name属性也已经被相应地设置好了。

In [33]:
# 方法一
df.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [34]:
# 方法二
df['year']

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [35]:
# 注意区分
df[['year']]

   year
0  2000
1  2001
2  2002
3  2001
4  2002
5  2003

#### 获取DataFrame的行

行也可以通过获取位置或名称的索引进行获取, **但一定要加上属性**，比如用`loc`属性

In [27]:
df.loc[[0, 2]]

  state  year  pop
0  Ohio  2000  1.5
2  Ohio  2002  3.6

### DataFrame的修改

列可以通过赋值的方式进行修改。为不存在的列赋值则会创建出一个新列。可以将列表或数组赋值给该列

In [32]:
import numpy as np
df['pop'] = np.arange(6.)
df

    state  year  pop
0    Ohio  2000  0.0
1    Ohio  2001  1.0
2    Ohio  2002  2.0
3  Nevada  2001  3.0
4  Nevada  2002  4.0
5  Nevada  2003  5.0

In [45]:
df['debt'] = ['T', 'F', 'T', 'F', 'T', 'F']
df

    state  year  pop debt
0    Ohio  2000  1.5    T
1    Ohio  2001  1.7    F
2    Ohio  2002  3.6    T
3  Nevada  2001  2.4    F
4  Nevada  2002  2.9    T
5  Nevada  2003  3.2    F

如果赋值的是一个`Series`，就会精确匹配DataFrame的索引，所有的空位都将被填上缺失值：

In [46]:
import pandas as pd
df1 = pd.DataFrame(
    data=df.values,
    index=['one', 'two', 'three', 'four', 'five', 'six'],
    columns=['state', 'year', 'pop', 'debt']
    )
df1

        state  year  pop debt
one      Ohio  2000  1.5    T
two      Ohio  2001  1.7    F
three    Ohio  2002  3.6    T
four   Nevada  2001  2.4    F
five   Nevada  2002  2.9    T
six    Nevada  2003  3.2    F

In [68]:
import pandas as pd
val = pd.Series(data=[5, 6], index = ['one', 'four'])
df1['population'] = val
df1

        state  year  pop debt  population
one      Ohio  2000  0.0    T         5.0
two      Ohio  2001  1.0    F         NaN
three    Ohio  2002  2.0    T         NaN
four   Nevada  2001  3.0    F         6.0
five   Nevada  2002  4.0    T         NaN
six    Nevada  2003  5.0    F         NaN

### DataFrame的删除

`del`方法可以用来删除某列

In [69]:
del df1['debt']
df1

        state  year  pop  population
one      Ohio  2000  0.0         5.0
two      Ohio  2001  1.0         NaN
three    Ohio  2002  2.0         NaN
four   Nevada  2001  3.0         6.0
five   Nevada  2002  4.0         NaN
six    Nevada  2003  5.0         NaN

### DataFrame的变换

转置

In [77]:
df1.T

             one   two three    four    five     six
state       Ohio  Ohio  Ohio  Nevada  Nevada  Nevada
year        2000  2001  2002    2001    2002    2003
pop          0.0   1.0   2.0     3.0     4.0     5.0
population   5.0   NaN   NaN     6.0     NaN     NaN

## 数据预处理

### 数据的排序和排名

#### 按行或者按列排序

pandas对象的一个重要方法是reindex，其作用是创建一个新对象，它的数据符合新的索引。如果某个索引值当前不存在，就引入缺失值。当向reindex传递索引或列名时，可以对行或列进行排序

In [53]:
import pandas as pd

df = pd.DataFrame({
    'A': [1, 2, 3],
    'B': [4, 5, 6],
    'C': [7, 8, 9]
}, index=['a', 'b', 'c'])
df

   A  B  C
a  1  4  7
b  2  5  8
c  3  6  9

In [54]:
# 重新索引行
df.reindex(index=['c', 'a', 'b'])

   A  B  C
c  3  6  9
a  1  4  7
b  2  5  8

In [55]:
# 重新索引列
df.reindex(columns=['B', 'A', 'C'])

   B  A  C
a  4  1  7
b  5  2  8
c  6  3  9

In [56]:
# reindex也可以达到筛选的效果
df.reindex(index=['a', 'b'],
                columns=['B', 'C']
                )

   B  C
a  4  7
b  5  8

也可使用sort_index()方法，其常用参数有：
- `axis`：指定按行或按列排序，默认按行
- `ascending`：默认按升序排序, 也可以指定值为False，按降序排序

In [5]:
import pandas as pd
df = pd.DataFrame({
    'B': [1, 2, 3],
    'A': [4, 5, 6],
    'C': [7, 8, 9]
}, index=['b', 'a', 'c'])
df

   B  A  C
b  1  4  7
a  2  5  8
c  3  6  9

In [4]:
df.sort_index()

   A  B  C
a  2  5  8
b  1  4  7
c  3  6  9

In [6]:
# 向axis传入1，按列排序
df.sort_index(axis = 1)

   A  B  C
b  4  1  7
a  5  2  8
c  6  3  9

In [7]:
df.sort_index(axis=1, ascending=False)

   C  B  A
b  7  1  4
a  8  2  5
c  9  3  6

#### 按值进行排序

在排序时，任何缺失值都会默认放置于末尾

In [11]:
import pandas as pd
import numpy as np
frame = pd.DataFrame({
    'b': [4, 7, -3, 2], 
    'a': [0, 1, 0, 1],
    'c': [np.nan,1, 9, np.nan ]
    })
frame

   b  a    c
0  4  0  NaN
1  7  1  1.0
2 -3  0  9.0
3  2  1  NaN

In [13]:
# 通过by参数确定按列进行值的排序
frame.sort_values(by='c')

   b  a    c
1  7  1  1.0
2 -3  0  9.0
0  4  0  NaN
3  2  1  NaN

In [15]:
frame.sort_values(by='a', ascending=False)

   b  a    c
1  7  1  1.0
3  2  1  NaN
0  4  0  NaN
2 -3  0  9.0

In [16]:
# 传入列表，先根据a列进行排序，然后再根据b列
frame.sort_values(by=['a', 'b'])

   b  a    c
2 -3  0  9.0
0  4  0  NaN
3  2  1  NaN
1  7  1  1.0

在pd.reindex()中结合向前向后填充，可以通过`method`参数来指定填充的方式。具体来说，可以设置`method='ffill'`来使用向前填充，`method='bfill'`来使用向后填充。但需要注意的是，填充方式只能应用于缺失的索引标签所在的行或列，**对于原来已经存在的行或列，不会进行填充**。

In [13]:
import pandas as pd
frame = pd.Series([4.2, 3.5, 6.9], index = [1, 3, 5])
frame

1    4.2
3    3.5
5    6.9
dtype: float64

In [14]:
frame.reindex(range(6))

0    NaN
1    4.2
2    NaN
3    3.5
4    NaN
5    6.9
dtype: float64

In [15]:
frame.reindex(range(6), method = 'ffill')

0    NaN
1    4.2
2    4.2
3    3.5
4    3.5
5    6.9
dtype: float64

In [16]:
frame.reindex(range(6), method = 'bfill')

0    4.2
1    4.2
2    3.5
3    3.5
4    6.9
5    6.9
dtype: float64

### 丢弃指定项(drop)

之前讲过用`del`删除指定列，其实用`drop`也可以，drop()里面的axis参数控制行列，axis值为0删除行，axis值为1或`colnums`删除列

In [1]:
import pandas as pd
import numpy as np
frame1 = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four']
                    )
frame1

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [21]:
# 删除列,需要指定axis，否则会报错
frame1.drop(['one'], axis = "columns")

          two  three  four
Ohio        1      2     3
Colorado    5      6     7
Utah        9     10    11
New York   13     14    15

In [22]:
# 删除行，默认是删除行
frame1.drop(['Ohio', 'Utah'])

          one  two  three  four
Colorado    4    5      6     7
New York   12   13     14    15

In [24]:
# 但是drop并不会改变原数据结构，要么用新变量赋值，要么加上参数inplace改变原数据集
frame1

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [25]:
frame1.drop('one', axis = 1, inplace = True)
frame1

          two  three  four
Ohio        1      2     3
Colorado    5      6     7
Utah        9     10    11
New York   13     14    15

### 选取与过滤

#### 简单索引提取数据

In [2]:
# 以下这种方法只适用于对列的提取
frame1['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [ ]:
# 对行提取该方法是不可以的
frame1['Ohio']

In [52]:
# 但却可以用标签的切片方式对行进行提取
# 该运算与普通的Python切片运算不同，其末端是包含的
frame1['Ohio':'Utah']

          two  three  four
Ohio        1      2     3
Colorado    5      6     7
Utah        9     10    11

In [ ]:
# 切片的方式只适用于series，也就是说只能对行进行切片提取，对列提取是不可以的
frame1['two':'three']

In [37]:
# 通过布尔值
frame1['four'] < 8

Ohio         True
Colorado     True
Utah        False
New York    False
Name: four, dtype: bool

In [39]:
frame1[frame1['four'] < 8]

          two  three  four
Ohio        1      2     3
Colorado    5      6     7

##### 用loc和iloc进行选取(建议使用这个)

对于DataFrame的行的标签索引，可以使用特殊的标签运算符`loc`和`iloc`。
其中`loc`是轴标签，`iloc`是整数索引。该种方法的限制较少

In [41]:
# 通过loc选取子集
frame1.loc['Ohio':'Utah', ['two', 'three']]

          two  three
Ohio        1      2
Colorado    5      6
Utah        9     10

In [55]:
# 通过loc选取单独行或行子集
frame1.loc['Ohio']

two      1
three    2
four     3
Name: Ohio, dtype: int32

In [57]:
# 通过loc选取单独列或列子集
frame1.loc[:, 'two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [43]:
# 通过iloc选取子集
frame1.iloc[[1, 2], [1, 2]]

          three  four
Colorado      6     7
Utah         10    11

In [53]:
# 通过iloc选取单独的行或行子集
frame1.iloc[1]

two      5
three    6
four     7
Name: Colorado, dtype: int32

In [54]:
# 通过iloc选取单独的列或列子集
frame1.iloc[:, 1]

Ohio         2
Colorado     6
Utah        10
New York    14
Name: three, dtype: int32

#### 层次化索引

层次化索引（hierarchical indexing）是pandas的一项重要功能，它使你能在一个轴上拥有多个（两个以上）索引级别。抽象点说，它使你能以低维度形式处理高维度数据。

In [13]:
import pandas as pd
import numpy as np
# 创建数据集
data = pd.Series(
    np.random.randn(9),
    index=[
        ['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
        [1, 2, 3, 1, 3, 1, 2, 2, 3]
        ]
    )
data
# 结果是经过美化的带有MultiIndex索引的Series形式。索引之间的间隔表示直接使用上面的标签

a  1    0.247003
   2   -0.485565
   3   -1.110161
b  1    0.646385
   3    0.995908
c  1    1.150304
   2   -2.027798
d  2   -0.199577
   3    0.111901
dtype: float64

对于一个层次化索引的对象，可以使用所谓的部分索引

In [16]:
data[['b', 'd']]

b  1    0.646385
   3    0.995908
d  2   -0.199577
   3    0.111901
dtype: float64

In [17]:
data['b':'d']

b  1    0.646385
   3    0.995908
c  1    1.150304
   2   -2.027798
d  2   -0.199577
   3    0.111901
dtype: float64

In [23]:
# 可以继续在“内层”中进行提取
data.loc[['a', 'd'], 2]
# 直接写data[['a', 'd'], 2]是错误的

a  2   -0.485565
d  2   -0.199577
dtype: float64

对于一个DataFrame，当然每条轴都可以有分层索引

In [69]:
frame = pd.DataFrame(
    np.arange(12).reshape((4, 3)),
    index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
    columns=[
        ['Ohio', 'Ohio', 'Colorado'],
        ['Green', 'Red', 'Green']
        ]
    )
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

可以为每层添加名字

In [27]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [28]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [30]:
frame[['Ohio', 'Colorado']]

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [34]:
frame['Ohio', 'Green']

key1  key2
a     1       0
      2       3
b     1       6
      2       9
Name: (Ohio, Green), dtype: int32

### 数据的分组

#### 数据的离散化和面元划分

为了便于分析，连续数据常常被离散化或拆分为“面元”(bin)。cut函数可以实现该功能。这与R的用法是类似的。其主要参数如下：
- `x`: 需要离散化的数据
- `bins`: 离散化的分组依据，可以是一个整数、一个序列或者一个区间，指定将x划分成多少个区间或者划分区间的边界值
- `labels`: 指定离散化后每个区间对应的标签
- `right`: 指定分割区间是否右闭合，默认为True即左开右闭合。False为左闭右开
- `precision`: 可指定区间小数精度

传入确切的面元边界

In [8]:
import pandas as pd
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
result = pd.cut(ages, bins)
result
# 返回区间，这与R的cut(data = ages, breaks = bins)是一致的

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [9]:
pd.cut(ages, bins, right=False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [10]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
new_result = pd.cut(ages, bins, labels=group_names)
new_result

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

传入确切的面元组数，pandas会根据数据的最小值和最大值计算等长面元

In [1]:
import pandas as pd
import numpy as np
data = pd.DataFrame(np.random.rand(20), columns=['num'])
data

         num
0   0.140744
1   0.912850
2   0.011658
3   0.150636
4   0.364458
5   0.749036
6   0.771515
7   0.101496
8   0.761592
9   0.867935
10  0.008744
11  0.307407
12  0.341269
13  0.857491
14  0.951609
15  0.495549
16  0.682880
17  0.258060
18  0.808951
19  0.171986

In [5]:
data['cats']=pd.cut(data['num'], 5, precision=2)
data

         num           cats
0   0.140744  (0.0078, 0.2]
1   0.912850   (0.76, 0.95]
2   0.011658  (0.0078, 0.2]
3   0.150636  (0.0078, 0.2]
4   0.364458    (0.2, 0.39]
5   0.749036   (0.57, 0.76]
6   0.771515   (0.76, 0.95]
7   0.101496  (0.0078, 0.2]
8   0.761592   (0.57, 0.76]
9   0.867935   (0.76, 0.95]
10  0.008744  (0.0078, 0.2]
11  0.307407    (0.2, 0.39]
12  0.341269    (0.2, 0.39]
13  0.857491   (0.76, 0.95]
14  0.951609   (0.76, 0.95]
15  0.495549   (0.39, 0.57]
16  0.682880   (0.57, 0.76]
17  0.258060    (0.2, 0.39]
18  0.808951   (0.76, 0.95]
19  0.171986  (0.0078, 0.2]

结果返回的是一个特殊的`Categorical`对象。该对象展示了pandas.cut划分的面元。pandas.value_counts用于统计一个Series中每个值的出现次数，返回一个新的Series，其中每个值是一个出现次数。两者结合可以显示面元的计数

In [11]:
pd.value_counts(result)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [12]:
pd.value_counts(new_result)

Youth         5
YoungAdult    3
MiddleAged    3
Senior        1
dtype: int64

也可以用pandas.qcut()。它可以根据样本分位数对数据进行面元划分，即得到大小基本相等的面元。其主要参数如下：
- `x`：要进行分组的数据，可以是一个Series，也可以是一个numpy数组。
- `q`：要将数据分成的组数或者分位数。当q为一个整数时，表示要将数据分成q组；当q为一个列表时，表示要将数据分成以q中的值为分位数的组。例如，q=[0, 0.25, 0.5, 0.75, 1]表示将数据分成4组，第一组是最小值到第一四分位数，以此类推。
- `labels`：分组后每个组的标签。可以是一个列表或者False。如果为False，则返回的是每个数据所属的分组编号，从1开始。如果为一个列表，则列表的长度应该和分组数相等，列表中的元素会被用作每个组的标签。
- `precision`：分位数的精度。

In [1]:
import pandas as pd
import numpy as np
test_data = np.random.rand(100)
test_data

array([0.42069542, 0.30582439, 0.94835546, 0.55014559, 0.34752482,
       0.35535607, 0.53759274, 0.02774647, 0.4786201 , 0.81439297,
       0.75228438, 0.79573869, 0.46346745, 0.44184041, 0.85150481,
       0.97815635, 0.06958289, 0.24249523, 0.01533801, 0.27956182,
       0.94498342, 0.69592965, 0.68007015, 0.42500617, 0.39905593,
       0.54777011, 0.43394917, 0.15460588, 0.07784816, 0.38176415,
       0.34537092, 0.2576082 , 0.65562873, 0.44851174, 0.45379935,
       0.32612903, 0.81262096, 0.56876942, 0.83290889, 0.10335316,
       0.34899157, 0.1457954 , 0.10069216, 0.96306344, 0.08094419,
       0.91239864, 0.08024603, 0.33494653, 0.21785482, 0.03563175,
       0.10395527, 0.24900216, 0.51432933, 0.25336314, 0.84018729,
       0.72416971, 0.61877532, 0.72341834, 0.3724234 , 0.37282981,
       0.1236545 , 0.15351501, 0.24472406, 0.76162948, 0.3282468 ,
       0.22672048, 0.04314372, 0.77916331, 0.58632088, 0.12821177,
       0.62291537, 0.58606841, 0.72286182, 0.99399104, 0.84782148,
       0.33107501, 0.60542822, 0.29907621, 0.88693237, 0.53043169,
       0.15353311, 0.76404489, 0.03637153, 0.06375975, 0.85805547,
       0.37768913, 0.25564195, 0.84078823, 0.687619  , 0.93761208,
       0.75357118, 0.73426918, 0.2393486 , 0.57283674, 0.42491799,
       0.75215995, 0.3125384 , 0.20603771, 0.02771226, 0.24637408])

In [2]:
# 传入一个整数
result = pd.qcut(test_data, 4, precision=2)

In [9]:
pd.value_counts(result)

(0.004, 0.3]    25
(0.3, 0.54]     25
(0.54, 0.75]    25
(0.75, 1.0]     25
dtype: int64

In [15]:
result2 = pd.qcut(test_data, [0, 0.25, 0.5, 0.75, 1], precision=2)

In [16]:
pd.value_counts(result2)

(0.004, 0.3]    25
(0.3, 0.54]     25
(0.54, 0.75]    25
(0.75, 1.0]     25
dtype: int64

#### 数据分类与指标/哑变量

可以将分类变量转换为“哑变量”或“指标矩阵”。这样更方便统计计算。利用函数series.get_dummies(),可以传入参数`prefix`表示前缀。

In [4]:
import pandas as pd
import numpy as np
df = pd.DataFrame(data={'data1': range(6),
                   'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   }
                   )
df

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   b

In [5]:
# 将指定的分类列作为参数传入函数内
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [10]:
# 将面元划分和哑变量变换可以更加有利于统计应用
import pandas as pd
import numpy as np
combine_data = np.random.rand(100) 
combine_data

array([0.77024457, 0.96590208, 0.02705088, 0.93975083, 0.15205092,
       0.44829332, 0.08283908, 0.18815961, 0.28609132, 0.30285999,
       0.59178927, 0.28118635, 0.38200052, 0.09709018, 0.90547022,
       0.2170494 , 0.77999149, 0.25465801, 0.72331535, 0.08794819,
       0.28027915, 0.62124317, 0.54340543, 0.89813886, 0.03114826,
       0.56579946, 0.52695295, 0.96534867, 0.36048716, 0.34755042,
       0.03513596, 0.40320188, 0.32524883, 0.27449456, 0.08311583,
       0.7554759 , 0.78856477, 0.83583544, 0.74687609, 0.44811184,
       0.7695373 , 0.62720768, 0.85587035, 0.47718978, 0.67761633,
       0.20978092, 0.42166837, 0.66047378, 0.17001674, 0.35994469,
       0.61731129, 0.75021446, 0.66530281, 0.92137824, 0.14100949,
       0.78891211, 0.13553616, 0.17031509, 0.50075654, 0.66797139,
       0.5060223 , 0.36612251, 0.04033037, 0.84785104, 0.43770095,
       0.40557123, 0.61000674, 0.0956675 , 0.70936852, 0.67959712,
       0.78020649, 0.50172656, 0.03318954, 0.27049142, 0.19040157,
       0.59050323, 0.63983084, 0.70561132, 0.88284444, 0.97720402,
       0.91632957, 0.01121421, 0.23319928, 0.5443176 , 0.69206355,
       0.08780915, 0.1091998 , 0.71210854, 0.56859031, 0.30739284,
       0.94734945, 0.65263438, 0.70435055, 0.14297497, 0.53300905,
       0.68331313, 0.66630395, 0.33945586, 0.75132087, 0.46510019])

In [11]:
# 将面元划分直接传入函数当中
pd.get_dummies(pd.cut(combine_data, 5, precision=2), prefix="区间")

,"区间_(0.01, 0.2]","区间_(0.2, 0.4]","区间_(0.4, 0.59]","区间_(0.59, 0.78]","区间_(0.78, 0.98]"
0,0,0,0,1,0
1,0,0,0,0,1
2,1,0,0,0,0
3,0,0,0,0,1
4,1,0,0,0,0
...,...,...,...,...,...
95,0,0,0,1,0
96,0,0,0,1,0
97,0,1,0,0,0
98,0,0,0,1,0
99,0,0,1,0,0

### 数据的修改调整

#### 索引的修改

##### 通过重构建就地修改数据结构

In [5]:
import pandas as pd 
import numpy as np
re_df = pd.DataFrame(np.arange(12).reshape((3, 4)))
re_df

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [6]:
import pandas as pd
new_re_df = pd.DataFrame(re_df.values, 
                         index=['Ohio', 'Colorado', 'New York'],
                         columns=['one', 'two', 'three', 'four']
                         )
new_re_df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

此时可以顺带提一下索引的创建

1. 简单索引（一维）的创建

`pd.Index()`常见参数：
- `data`：可选参数，表示要作为索引的数据。可以是列表、数组、Series或其他类似对象。
- `dtype`：可选参数，表示索引的数据类型。
- `name`：可选参数，表示索引对象的名称。

In [29]:
import pandas as pd
index = pd.Index(['apple', 'banana', 'orange', 'pear'], name='fruit')
index

Index(['apple', 'banana', 'orange', 'pear'], dtype='object', name='fruit')

2. 层次索引的创建

`pd.MultiIndex()`常见参数：
- `levels`：必选参数，表示每个级别的标签。可以是列表、元组、数组或其他类似对象。
- `codes`：必选参数，表示每个级别中标签对应的代码。必须是一个整数数组，与levels参数的维度和大小一致。
- `names`：可选参数，表示每个级别的名称。可以是字符串或其他类似对象。必须与levels参数的维度和大小一致。
- `dtype`：可选参数，表示多重索引对象的数据类型。

In [ ]:
import pandas as pd

arrays = [['bar', 'bar', 'baz', 'baz', 'foo', 'foo'],
          ['one', 'two', 'one', 'two', 'one', 'two']]
index = pd.MultiIndex.from_arrays(arrays, names=('first', 'second'))
print(index)

##### 通过rename函数

rename函数可以接受一个字典或函数作为参数，用于指定新的列名或行名。可以加上参数`inplace`

In [7]:
new_re_df.rename(index={'Ohio': 'ohio'},
            columns={'one':'One'},
            inplace=True
            )
new_re_df

          One  two  three  four
ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [8]:
new_re_df.rename(index=str.title, 
                 columns=str.upper
                 )

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

##### 重塑和轴向旋转

有许多用于重新排列表格型数据的基础运算。这些函数也称作重塑（reshape）或轴向旋转（pivot）运算。

>长格式（Long Format）和宽格式（Wide Format）是两种不同的数据表现方式，它们在数据结构上的组织方式不同，适用于不同的数据分析场景。长格式通常用于描述具有多个变量和多个取值的数据。在长格式中，每个观察值（即每行数据）通常由多个列组成，其中一个列用于标识观察的单位，一个列用于标识变量名称，另一个列用于标识变量取值。宽格式通常用于描述具有少量变量和多个取值的数据。在宽格式中，每个观察值通常由一行表示，其中每个变量对应一个列，每个取值对应一个单元格。

**长格式**
| 城市   | 年份 | 人口数量 |
| ------ | ---- | -------- |
| 北京   | 2010 | 2000万   |
| 北京   | 2011 | 2100万   |
| 北京   | 2012 | 2200万   |
| 北京   | 2013 | 2300万   |
| 上海   | 2010 | 2200万   |
| 上海   | 2011 | 2250万   |
| 上海   | 2012 | 2300万   |
| 上海   | 2013 | 2350万   |
| 广州   | 2010 | 1000万   |
| 广州   | 2011 | 1050万   |
| 广州   | 2012 | 1100万   |
| 广州   | 2013 | 1150万   |

**宽格式**
| 城市 | 2010年 | 2011年 | 2012年 | 2013年 |
| ---- | ------ | ------ | ------ | ------ |
| 北京 | 2000万 | 2100万 | 2200万 | 2300万 |
| 上海 | 2200万 | 2250万 | 2300万 | 2350万 |
| 广州 | 1000万 | 1050万 | 1100万 | 1150万 |

1. 将宽格式转换为长格式

In [3]:
# 可以通过pd.Index来创建索引，同时通过name参数进行命名
import pandas as pd
import numpy as np
data = pd.DataFrame(
    np.arange(9).reshape((3, 3)),
    index=pd.Index(['Ohio', 'Colorado', 'Chicago'], name='state'),
    columns=pd.Index(['one', 'two', 'three'], name='number')
    )
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5
Chicago     6    7      8

In [4]:
# 未进行命名的对比结果
data1 = pd.DataFrame(
    np.arange(9).reshape((3, 3)),
    index=pd.Index(['Ohio', 'Colorado', 'Chicago']),
    columns=pd.Index(['one', 'two', 'three'])
    )
data1

          one  two  three
Ohio        0    1      2
Colorado    3    4      5
Chicago     6    7      8

In [5]:
# `stack`将数据的列“旋转”成行,得到一个series
data.stack()

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
Chicago   one       6
          two       7
          three     8
dtype: int32

In [12]:
# 未进行命名stack后的对比结果
data1.stack()

Ohio      one      0
          two      1
          three    2
Colorado  one      3
          two      4
          three    5
Chicago   one      6
          two      7
          three    8
dtype: int32

In [7]:
# 通过reset_index()将这个结果转换成数据集
data.stack().reset_index()

      state number  0
0      Ohio    one  0
1      Ohio    two  1
2      Ohio  three  2
3  Colorado    one  3
4  Colorado    two  4
5  Colorado  three  5
6   Chicago    one  6
7   Chicago    two  7
8   Chicago  three  8

In [7]:
data1.stack().reset_index()

    level_0 level_1  0
0      Ohio     one  0
1      Ohio     two  1
2      Ohio   three  2
3  Colorado     one  3
4  Colorado     two  4
5  Colorado   three  5

In [14]:
# 观察到变量列没有列名，而是以0替代的。可以通过rename对所有变量重命名,再reset_index()，对比结果如下
data.stack().rename('value').reset_index()

      state number  value
0      Ohio    one      0
1      Ohio    two      1
2      Ohio  three      2
3  Colorado    one      3
4  Colorado    two      4
5  Colorado  three      5
6   Chicago    one      6
7   Chicago    two      7
8   Chicago  three      8

In [8]:
# 数据实战
import pandas as pd
df = pd.read_csv('pandas素材\用于评价分析的特征.csv', header = 0)
df.head()

,Deliver,Deliver_Count,DDay_mean,DDay_min,DDay_max,DNum_sum,DNum_mean,DNum_min,DNum_max,DNum_std,...,RNum_min,RNum_max,RNum_std,RNum_median,RNum_zero,RNum_meanM_y,RNum_minM_y,RNum_maxM_y,RNum_stdM_y,RNum_medianM_y
0,A,2,190.50,171,210,31276,165.481482,42,420,98.515556,...,42,426,96.400947,180.5,4,5745.333333,2513,7777,1765.567827,6199
1,B,1,67.00,67,67,12458,185.940299,45,340,102.783073,...,42,455,159.196883,252.0,0,5208.000000,2214,8079,2934.434017,5331
2,C,4,135.75,48,208,18361,90.004902,42,181,42.661862,...,42,104,24.036815,84.5,33,1469.777778,302,2143,676.217380,1763
3,D,4,177.00,137,235,31135,130.819328,42,303,79.955136,...,43,376,85.437851,182.5,0,5822.333333,2434,7997,2071.628647,6171
4,E,1,168.00,168,168,14643,89.834356,42,267,54.886557,...,42,224,53.410451,109.0,8,2865.000000,1053,4017,1084.227221,3020

In [9]:
del df['Deliver']
df.head()

,Deliver_Count,DDay_mean,DDay_min,DDay_max,DNum_sum,DNum_mean,DNum_min,DNum_max,DNum_std,DNum_median,...,RNum_min,RNum_max,RNum_std,RNum_median,RNum_zero,RNum_meanM_y,RNum_minM_y,RNum_maxM_y,RNum_stdM_y,RNum_medianM_y
0,2,190.50,171,210,31276,165.481482,42,420,98.515556,129.0,...,42,426,96.400947,180.5,4,5745.333333,2513,7777,1765.567827,6199
1,1,67.00,67,67,12458,185.940299,45,340,102.783073,214.0,...,42,455,159.196883,252.0,0,5208.000000,2214,8079,2934.434017,5331
2,4,135.75,48,208,18361,90.004902,42,181,42.661862,85.0,...,42,104,24.036815,84.5,33,1469.777778,302,2143,676.217380,1763
3,4,177.00,137,235,31135,130.819328,42,303,79.955136,127.5,...,43,376,85.437851,182.5,0,5822.333333,2434,7997,2071.628647,6171
4,1,168.00,168,168,14643,89.834356,42,267,54.886557,60.0,...,42,224,53.410451,109.0,8,2865.000000,1053,4017,1084.227221,3020

In [10]:
df = df.corr()
df.head()

,Deliver_Count,DDay_mean,DDay_min,DDay_max,DNum_sum,DNum_mean,DNum_min,DNum_max,DNum_std,DNum_median,...,RNum_min,RNum_max,RNum_std,RNum_median,RNum_zero,RNum_meanM_y,RNum_minM_y,RNum_maxM_y,RNum_stdM_y,RNum_medianM_y
Deliver_Count,1.000000,0.485864,0.098598,0.585080,0.848921,0.831366,0.382948,0.823357,0.795962,0.816916,...,0.780121,0.766672,0.729414,0.778966,-0.116679,0.813188,0.789995,0.760253,0.548337,0.816899
DDay_mean,0.485864,1.000000,0.739547,0.918334,0.611378,0.505507,0.310672,0.577069,0.555303,0.454195,...,0.411514,0.587284,0.545483,0.391545,-0.118374,0.519364,0.475225,0.598994,0.490171,0.503489
DDay_min,0.098598,0.739547,1.000000,0.447276,0.332429,0.293220,0.202585,0.351641,0.342572,0.235297,...,0.236988,0.374337,0.341774,0.224962,-0.499061,0.312888,0.250993,0.374360,0.348063,0.297380
DDay_max,0.585080,0.918334,0.447276,1.000000,0.582254,0.453673,0.214106,0.530574,0.508720,0.406865,...,0.381085,0.541039,0.501702,0.356838,0.086436,0.487240,0.454938,0.550677,0.443204,0.477914
DNum_sum,0.848921,0.611378,0.332429,0.582254,1.000000,0.983842,0.605753,0.974108,0.960219,0.969002,...,0.903691,0.938605,0.915557,0.931802,-0.277943,0.971709,0.954210,0.933438,0.657799,0.967222

In [12]:
index = pd.Index(df.index.values, name = 'key1')
columns = pd.Index(df.columns.values, name = 'key2')
df = pd.DataFrame(data = df.values,
                  index = index,
                  columns = columns)

# 或者直接:
# df.index.name='key1'
# df.columns.name='key2'
df.head()

key2,Deliver_Count,DDay_mean,DDay_min,DDay_max,DNum_sum,DNum_mean,DNum_min,DNum_max,DNum_std,DNum_median,...,RNum_min,RNum_max,RNum_std,RNum_median,RNum_zero,RNum_meanM_y,RNum_minM_y,RNum_maxM_y,RNum_stdM_y,RNum_medianM_y
key1,,,,,,,,,,,,,,,,,,,,,
Deliver_Count,1.000000,0.485864,0.098598,0.585080,0.848921,0.831366,0.382948,0.823357,0.795962,0.816916,...,0.780121,0.766672,0.729414,0.778966,-0.116679,0.813188,0.789995,0.760253,0.548337,0.816899
DDay_mean,0.485864,1.000000,0.739547,0.918334,0.611378,0.505507,0.310672,0.577069,0.555303,0.454195,...,0.411514,0.587284,0.545483,0.391545,-0.118374,0.519364,0.475225,0.598994,0.490171,0.503489
DDay_min,0.098598,0.739547,1.000000,0.447276,0.332429,0.293220,0.202585,0.351641,0.342572,0.235297,...,0.236988,0.374337,0.341774,0.224962,-0.499061,0.312888,0.250993,0.374360,0.348063,0.297380
DDay_max,0.585080,0.918334,0.447276,1.000000,0.582254,0.453673,0.214106,0.530574,0.508720,0.406865,...,0.381085,0.541039,0.501702,0.356838,0.086436,0.487240,0.454938,0.550677,0.443204,0.477914
DNum_sum,0.848921,0.611378,0.332429,0.582254,1.000000,0.983842,0.605753,0.974108,0.960219,0.969002,...,0.903691,0.938605,0.915557,0.931802,-0.277943,0.971709,0.954210,0.933438,0.657799,0.967222

In [17]:
df.stack().rename('corr').reset_index().head()

            key1           key2      corr
0  Deliver_Count  Deliver_Count  1.000000
1  Deliver_Count      DDay_mean  0.485864
2  Deliver_Count       DDay_min  0.098598
3  Deliver_Count       DDay_max  0.585080
4  Deliver_Count       DNum_sum  0.848921

In [116]:
df = pd.DataFrame(
    {'key': ['foo', 'bar', 'baz'],
    'A': [1, 2, 3],
    'B': [4, 5, 6],
    'C': [7, 8, 9]
    }
)
df

   key  A  B  C
0  foo  1  4  7
1  bar  2  5  8
2  baz  3  6  9

In [117]:
# 旋转DataFrame的逆运算是pandas.melt。
# key列是分组指标
import pandas as pd
result = pd.melt(df, ['key'])
result

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6
6  foo        C      7
7  bar        C      8
8  baz        C      9

In [123]:
reshaped = result.pivot(index='key', columns='variable', values='value')
reshaped.reset_index()

variable  key  A  B  C
0         bar  2  5  8
1         baz  3  6  9
2         foo  1  4  7

2. 将长格式旋转为宽格式

In [87]:
import pandas as pd
macrodata = pd.read_csv('../pandas素材/macrodata.csv')
macrodata.head(6)

,year,quarter,realgdp,realcons,realinv,realgovt,realdpi,cpi,m1,tbilrate,unemp,pop,infl,realint
0,1959,1,2710.349,1707.4,286.898,470.045,1886.9,28.98,139.7,2.82,5.8,177.146,0.00,0.00
1,1959,2,2778.801,1733.7,310.859,481.301,1919.7,29.15,141.7,3.08,5.1,177.830,2.34,0.74
2,1959,3,2775.488,1751.8,289.226,491.260,1916.4,29.35,140.5,3.82,5.3,178.657,2.74,1.09
3,1959,4,2785.204,1753.7,299.356,484.052,1931.3,29.37,140.0,4.33,5.6,179.386,0.27,4.06
4,1960,1,2847.699,1770.5,331.722,462.199,1955.5,29.54,139.6,3.50,5.2,180.007,2.31,1.19
5,1960,2,2834.390,1792.9,298.152,460.400,1966.1,29.55,140.2,2.68,5.2,180.671,0.14,2.55

In [93]:
# 数据准备
import pandas as pd
periods = pd.PeriodIndex(
    year=macrodata.year, 
    quarter=macrodata.quarter,
    name='date'
    )

columns = pd.Index(['realgdp', 'infl', 'unemp'], name='item')
test_data = macrodata.reindex(columns=columns)

test_data.index = periods.to_timestamp('D', 'end')

fianl_data = test_data.stack().reset_index().rename(columns={0: 'value'})
fianl_data

                             date     item      value
0   1959-03-31 23:59:59.999999999  realgdp   2710.349
1   1959-03-31 23:59:59.999999999     infl      0.000
2   1959-03-31 23:59:59.999999999    unemp      5.800
3   1959-06-30 23:59:59.999999999  realgdp   2778.801
4   1959-06-30 23:59:59.999999999     infl      2.340
..                            ...      ...        ...
604 2009-06-30 23:59:59.999999999     infl      3.370
605 2009-06-30 23:59:59.999999999    unemp      9.200
606 2009-09-30 23:59:59.999999999  realgdp  12990.341
607 2009-09-30 23:59:59.999999999     infl      3.560
608 2009-09-30 23:59:59.999999999    unemp      9.600

[609 rows x 3 columns]

In [95]:
# 对上述步骤一个个的拆解
columns = pd.Index(['realgdp', 'infl', 'unemp'], name='item')
test_data = macrodata.reindex(columns=columns)
test_data

item    realgdp  infl  unemp
0      2710.349  0.00    5.8
1      2778.801  2.34    5.1
2      2775.488  2.74    5.3
3      2785.204  0.27    5.6
4      2847.699  2.31    5.2
..          ...   ...    ...
198   13324.600 -3.16    6.0
199   13141.920 -8.79    6.9
200   12925.410  0.94    8.1
201   12901.504  3.37    9.2
202   12990.341  3.56    9.6

[203 rows x 3 columns]

In [102]:
test_data.index = periods.to_timestamp('D', 'end')
test_data

item                             realgdp  infl  unemp
date
1959-03-31 23:59:59.999999999   2710.349  0.00    5.8
1959-06-30 23:59:59.999999999   2778.801  2.34    5.1
1959-09-30 23:59:59.999999999   2775.488  2.74    5.3
1959-12-31 23:59:59.999999999   2785.204  0.27    5.6
1960-03-31 23:59:59.999999999   2847.699  2.31    5.2
...                                  ...   ...    ...
2008-09-30 23:59:59.999999999  13324.600 -3.16    6.0
2008-12-31 23:59:59.999999999  13141.920 -8.79    6.9
2009-03-31 23:59:59.999999999  12925.410  0.94    8.1
2009-06-30 23:59:59.999999999  12901.504  3.37    9.2
2009-09-30 23:59:59.999999999  12990.341  3.56    9.6

[203 rows x 3 columns]

In [107]:
test_data.stack()

date                           item
1959-03-31 23:59:59.999999999  realgdp     2710.349
                               infl           0.000
                               unemp          5.800
1959-06-30 23:59:59.999999999  realgdp     2778.801
                               infl           2.340
                                            ...
2009-06-30 23:59:59.999999999  infl           3.370
                               unemp          9.200
2009-09-30 23:59:59.999999999  realgdp    12990.341
                               infl           3.560
                               unemp          9.600
Length: 609, dtype: float64

In [109]:
test_data.stack().reset_index()

                             date     item          0
0   1959-03-31 23:59:59.999999999  realgdp   2710.349
1   1959-03-31 23:59:59.999999999     infl      0.000
2   1959-03-31 23:59:59.999999999    unemp      5.800
3   1959-06-30 23:59:59.999999999  realgdp   2778.801
4   1959-06-30 23:59:59.999999999     infl      2.340
..                            ...      ...        ...
604 2009-06-30 23:59:59.999999999     infl      3.370
605 2009-06-30 23:59:59.999999999    unemp      9.200
606 2009-09-30 23:59:59.999999999  realgdp  12990.341
607 2009-09-30 23:59:59.999999999     infl      3.560
608 2009-09-30 23:59:59.999999999    unemp      9.600

[609 rows x 3 columns]

In [111]:
final_data = test_data.stack().reset_index().rename(columns={0:'value'})
final_data

                             date     item      value
0   1959-03-31 23:59:59.999999999  realgdp   2710.349
1   1959-03-31 23:59:59.999999999     infl      0.000
2   1959-03-31 23:59:59.999999999    unemp      5.800
3   1959-06-30 23:59:59.999999999  realgdp   2778.801
4   1959-06-30 23:59:59.999999999     infl      2.340
..                            ...      ...        ...
604 2009-06-30 23:59:59.999999999     infl      3.370
605 2009-06-30 23:59:59.999999999    unemp      9.200
606 2009-09-30 23:59:59.999999999  realgdp  12990.341
607 2009-09-30 23:59:59.999999999     infl      3.560
608 2009-09-30 23:59:59.999999999    unemp      9.600

[609 rows x 3 columns]

>在执行 pivot() 函数时，需要指定哪些列的值用作行索引、哪些列的值用作列索引，以及哪些列的值用作数据。示例如下：

>dataframe.pivot(index='', columns='', values='')

In [115]:
final_data.pivot(index='date', columns='item', values='value')

item                           infl    realgdp  unemp
date
1959-03-31 23:59:59.999999999  0.00   2710.349    5.8
1959-06-30 23:59:59.999999999  2.34   2778.801    5.1
1959-09-30 23:59:59.999999999  2.74   2775.488    5.3
1959-12-31 23:59:59.999999999  0.27   2785.204    5.6
1960-03-31 23:59:59.999999999  2.31   2847.699    5.2
...                             ...        ...    ...
2008-09-30 23:59:59.999999999 -3.16  13324.600    6.0
2008-12-31 23:59:59.999999999 -8.79  13141.920    6.9
2009-03-31 23:59:59.999999999  0.94  12925.410    8.1
2009-06-30 23:59:59.999999999  3.37  12901.504    9.2
2009-09-30 23:59:59.999999999  3.56  12990.341    9.6

[203 rows x 3 columns]

通过reset_index()函数，可以重新设置DataFrame或Series的索引，返回一个新的DataFrame或Series对象。默认情况下，重置索引时会将原来的索引转换为一个新的名为 "index" 的列，并生成一个新的整数索引。如果原来的索引已经是整数索引，则只是将其作为新的列添加到DataFrame中。该函数有以下参数：
- `drop`：默认为 False，表示是否丢弃原来的索引。如果设置为 True，则会将原来的索引删除；
- `inplace`：默认为 False，表示是否直接对原始对象进行修改。如果设置为 True，则会直接对原始对象进行修改，而不是返回一个新的对象；
- `level`：用于多层索引的情况，表示要重置的索引的层级。

In [9]:
re_df.reset_index()

   index  0  1   2   3
0      0  0  1   2   3
1      1  4  5   6   7
2      2  8  9  10  11

In [10]:
new_re_df.reset_index()

      index  One  two  three  four
0      ohio    0    1      2     3
1  Colorado    4    5      6     7
2  New York    8    9     10    11

In [11]:
new_re_df.reset_index(drop=True)

   One  two  three  four
0    0    1      2     3
1    4    5      6     7
2    8    9     10    11

In [13]:
frame = pd.DataFrame(
    np.arange(12).reshape((4, 3)),
    index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
    columns=[
        ['Ohio', 'Ohio', 'Colorado'],
        ['Green', 'Red', 'Green']
        ]
    )
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [15]:
# 层次化索引的级别会被转移到列里面：
frame.reset_index(level=1)

  level_1  Ohio     Colorado
          Green Red    Green
a       1     0   1        2
a       2     3   4        5
b       1     6   7        8
b       2     9  10       11

In [14]:
frame.reset_index()

  level_0 level_1  Ohio     Colorado
                  Green Red    Green
0       a       1     0   1        2
1       a       2     3   4        5
2       b       1     6   7        8
3       b       2     9  10       11

#### 数据框的算术运算

##### add,radd

1. 数据框相加（数据对齐）

pandas最重要的一个功能是，它可以对不同索引的对象进行算术运算。在将对象相加时，如果存在不同的索引对，则结果的索引就是该索引对的并集。

In [50]:
import pandas as pd
import numpy as np
test1 = pd.DataFrame(
    np.arange(9.).reshape((3, 3)), 
    columns=list('bcd'),
    index=['Ohio', 'Texas', 'Colorado']
    )

test2= pd.DataFrame(
    np.arange(12.).reshape((4, 3)), 
    columns=list('bde'),
    index=['Utah', 'Ohio', 'Texas', 'Oregon']
    )

In [51]:
test1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [52]:
test2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

相加后将会返回一个新的DataFrame，其索引和列为原来那两个DataFrame的并集,且没有公共标签和列的会以缺省值体现出来。

In [53]:
test1 + test2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [54]:
# 两个是等价的
test1.add(test2)

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

2. 加上一个常数值

In [55]:
test1.add(2)

            b    c     d
Ohio      2.0  3.0   4.0
Texas     5.0  6.0   7.0
Colorado  8.0  9.0  10.0

##### sub,rsub

In [5]:
test1.sub(test2)

            b   c    d   e
Colorado  NaN NaN  NaN NaN
Ohio     -3.0 NaN -2.0 NaN
Oregon    NaN NaN  NaN NaN
Texas    -3.0 NaN -2.0 NaN
Utah      NaN NaN  NaN NaN

In [7]:
# r表示反向操作，即相当于test2.sub(test1)
test1.rsub(test2)

            b   c    d   e
Colorado  NaN NaN  NaN NaN
Ohio      3.0 NaN  2.0 NaN
Oregon    NaN NaN  NaN NaN
Texas     3.0 NaN  2.0 NaN
Utah      NaN NaN  NaN NaN

In [56]:
test1.sub(3)

            b    c    d
Ohio     -3.0 -2.0 -1.0
Texas     0.0  1.0  2.0
Colorado  3.0  4.0  5.0

##### div,rdiv

In [8]:
test1.rdiv(1)

                 b         c      d
Ohio           inf  1.000000  0.500
Texas     0.333333  0.250000  0.200
Colorado  0.166667  0.142857  0.125

#### 数据转换

##### 移除重复值

先查看是否有重复值：

`duplicated`是一个pandas函数，用于查找DataFrame或Series中的重复行。它返回一个布尔值Series，指示每行是否与之前的任何行重复。有`keep`参数，默认是first：
- keep='first'：保留第一个重复项，其他的标记为重复；
- keep='last'：保留最后一个重复项，其他的标记为重复；
- keep=False：所有的重复项都标记为重复

In [3]:
import pandas as pd
import numpy as np
data = pd.DataFrame(
    {'food': ['bacon', 'pulled pork', 'bacon','Pastrami', 'corned beef', 'bacon','pastrami', 'honey ham', 'nova lox'],
     'ounces': [4, 3, 12, 6, 7.5, 4, 3, 5, 6]
    }
    )
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        bacon     4.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [4]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
6    False
7    False
8    False
dtype: bool

In [5]:
# 指定特定列
data['food'].duplicated()

0    False
1    False
2     True
3    False
4    False
5     True
6    False
7    False
8    False
Name: food, dtype: bool

然后可以丢弃重复值

In [6]:
data.drop_duplicates()

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [8]:
# 指定特殊列
data['food'].drop_duplicates(keep='last')

1    pulled pork
3       Pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

##### 数据替换

有的时候数据可能会存在异常值，对这些异常值可以进行替换处理

In [8]:
# 全局取消证书验证
import pandas as pd
import ssl
import numpy as np
ssl._create_default_https_context = ssl._create_unverified_context

data = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/breast-cancer-wisconsin/breast-cancer-wisconsin.data')

In [3]:
data.replace('?', np.nan)

     1000025  5   1  1.1  1.2  2 1.3   3  1.4  1.5  2.1
0    1002945  5   4    4    5  7  10   3    2    1    2
1    1015425  3   1    1    1  2   2   3    1    1    2
2    1016277  6   8    8    1  3   4   3    7    1    2
3    1017023  4   1    1    3  2   1   3    1    1    2
4    1017122  8  10   10    8  7  10   9    7    1    4
..       ... ..  ..  ...  ... ..  ..  ..  ...  ...  ...
693   776715  3   1    1    1  3   2   1    1    1    2
694   841769  2   1    1    1  2   1   1    1    1    2
695   888820  5  10   10    3  7   3   8   10    2    4
696   897471  4   8    6    4  3   4  10    6    1    4
697   897471  4   8    8    5  4   5  10    4    1    4

[698 rows x 11 columns]

In [32]:
import pandas as pd
series= pd.Series([1., -999., 2., -999., -1000., 3.])

In [33]:
# 对单个异常值进行替换
series.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [16]:
# 对多个异常值同时进行替换
series.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [17]:
# 对多个异常值进行单独替换
# 方法一：传递替换列表
series.replace([-999, -1000], [4, 5])

0    1.0
1    4.0
2    2.0
3    4.0
4    5.0
5    3.0
dtype: float64

In [18]:
# 方法二：字典形式
series.replace({-999:4, -1000:5})

0    1.0
1    4.0
2    2.0
3    4.0
4    5.0
5    3.0
dtype: float64

#### 缺失值处理

通常在数据分析之前，需要对数据进行缺失值处理。缺失值处理是数据分析任务中的一个重要组成部分。在Pandas中，缺失值可以使用`None`或`numpy.nan`（通常简写为 `np.nan`）来创建。同时在读取数据时，Pandas使用浮点值`NaN`（Not a Number）表示缺失数据。即哨兵值。

In [5]:
# None只能表示数值型的缺省值
import pandas as pd
import numpy as np
df_na = pd.DataFrame(
    {'something':['one', 'two', 'three'],
     'a': [1, 5, 9],
     'b': [2, 6, 10],
     'c': [3.0, None, 11.0],
     'd': [4, 8, 10],
     'message': [None, 'world', 'foo']
     }
)
df_na

  something  a   b     c   d message
0       one  1   2   3.0   4    None
1       two  5   6   NaN   8   world
2     three  9  10  11.0  10     foo

前面提到过通过`reindex`对数据进行缺省值填充，但此方法终究有所限制，需要更细致的方法

In [17]:
import pandas as pd
import numpy as np
df_na = pd.DataFrame(
    {'something':['one', 'two', 'three'],
     'a': [1, np.nan, 9],
     'b': [2, 6, 10],
     'c': [3.0, np.nan, 11.0],
     'd': [4, 8, 10],
     'message': [np.nan, 'world', 'foo']
     }
)
df_na

  something    a   b     c   d message
0       one  1.0   2   3.0   4     NaN
1       two  NaN   6   NaN   8   world
2     three  9.0  10  11.0  10     foo

##### 判断是否有缺省值

In [36]:
# 方法一，对全部数据进行判断
pd.isna(df_na)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False   True  False   True  False    False
2      False  False  False  False  False    False

In [33]:
# 方法二， 对列判断
# 判断所有列的每一列是否存在缺失值
pd.isna(df_na).any()

something    False
a            False
b            False
c             True
d            False
message       True
dtype: bool

In [37]:
# 判断所有列的每一列列是否全部为缺失值
pd.isna(df_na).all()

something    False
a            False
b            False
c            False
d            False
message      False
dtype: bool

In [18]:
# 判断单个列是否存在缺失值
pd.isna(df_na['a'])

0    False
1     True
2    False
Name: a, dtype: bool

##### 丢弃缺省值

`dropna()`用于删除DataFrame或Series中包含缺失值的行或列。有以下参数：

- `axis`：指定删除行还是列，默认为删除行。
- `inplace`：默认为False
- `how`：指定如何判断缺失值，默认为any，表示只要有任意一个缺失值就删除该行或列。可以设置为all，表示该行或列全部为缺失值才删除；
- `thresh`：指定行或列中非缺失值的最小数量，若小于该数量则删除

In [22]:
df_na.dropna()
df_na

  something    a   b     c   d message
0       one  1.0   2   3.0   4     NaN
1       two  NaN   6   NaN   8   world
2     three  9.0  10  11.0  10     foo

In [23]:
# 按列删除
df_na.dropna(axis=1, inplace=True)
df_na

  something   b   d
0       one   2   4
1       two   6   8
2     three  10  10

不过很少对缺省数据直接进行删除

##### 填充缺省值

对于大多数情况而言，`fillna`方法是最主要的函数。常用参数有：
- `value`：表示要用于填充缺失值的标量值或字典、Series、DataFrame 等结构体。
- `method`：填充方法
- `inplace`：默认为False
- `limit`：（对于向前和向后填充）允许填充的最大数量

1. 填充常数值

In [25]:
df_na.fillna(0)

  something    a   b     c   d message
0       one  1.0   2   3.0   4       0
1       two  0.0   6   0.0   8   world
2     three  9.0  10  11.0  10     foo

In [28]:
# 通过字典形式对指定列进行填充
df_na.fillna({'a':0, 'c':0})

  something    a   b     c   d message
0       one  1.0   2   3.0   4     NaN
1       two  0.0   6   0.0   8   world
2     three  9.0  10  11.0  10     foo

In [49]:
df_na.fillna(
    {'a': df_na['d'].mean()}
    )

  something    a   b     c   d message
0       one  1.0   2   3.0   4     NaN
1       two  5.0   6   NaN   8   world
2     three  9.0  10  11.0  10     foo

2. 向前向后均值填充

In [48]:
fix1 = df_na['a'].fillna(method='ffill')    # 填充时可以指定某一列
fix2 = df_na['a'].fillna(method='bfill')
df_na['a'] = (fix1 + fix2)/2
df_na

  something    a   b     c   d message
0       one  1.0   2   3.0   4     NaN
1       two  5.0   6   NaN   8   world
2     three  9.0  10  11.0  10     foo

### 数据集的合并

#### 数据库风格的DataFrame合并(pandas.merge)

In [17]:
# 先举一例
import pandas as pd
df1 = pd.DataFrame(
    {'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
     'data1': range(7)}
     )
df2 = pd.DataFrame(
    {'key': ['a', 'b', 'd'],
    'data2': range(3)}
    )
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [18]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [20]:
df3 = pd.merge(df1, df2, on = 'key')
df3.drop('key', axis = 1)

   data1  data2
0      0      1
1      1      1
2      6      1
3      2      0
4      4      0
5      5      0

pandas.merge()类似于SQL中的JOIN操作，可根据一个或多个键（即列）将多个 DataFrame 连接在一起。其主要参数：
- `how`：连接方式，默认为`inner`，可选参数为：`left`、`right`、`outer`。其中outer则是使用两个表中的所有的键。
- `on`：连接的列名（两个 DataFrame 都有的列名），如果left和right的列名不同，可以省略。
- `left_on` 和 `right_on`：连接的列名，如果 left 和 right 的列名不同，必须指定。
- `left_index` 和 `right_index`：如果为 True，则使用左/右 DataFrame 的索引作为连接键。

In [21]:
df4 = pd.DataFrame(
    {'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
    'data1': range(7)}
    )
df5 = pd.DataFrame(
    {'rkey': ['a', 'b', 'd'],
    'data2': range(3)}
    )
df4

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [22]:
df5

  rkey  data2
0    a      0
1    b      1
2    d      2

In [24]:
import pandas as pd
pd.merge(df4, df5, left_on='lkey', right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [25]:
pd.merge(df4, df5, left_on='lkey', right_on='rkey', how='left')

  lkey  data1 rkey  data2
0    b      0    b    1.0
1    b      1    b    1.0
2    a      2    a    0.0
3    c      3  NaN    NaN
4    a      4    a    0.0
5    a      5    a    0.0
6    b      6    b    1.0

In [26]:
pd.merge(df4, df5, left_on='lkey', right_on='rkey', how='right')

  lkey  data1 rkey  data2
0    a    2.0    a      0
1    a    4.0    a      0
2    a    5.0    a      0
3    b    0.0    b      1
4    b    1.0    b      1
5    b    6.0    b      1
6  NaN    NaN    d      2

In [27]:
pd.merge(df4, df5, left_on='lkey', right_on='rkey', how='outer')

  lkey  data1 rkey  data2
0    b    0.0    b    1.0
1    b    1.0    b    1.0
2    b    6.0    b    1.0
3    a    2.0    a    0.0
4    a    4.0    a    0.0
5    a    5.0    a    0.0
6    c    3.0  NaN    NaN
7  NaN    NaN    d    2.0

In [28]:
left1 = pd.DataFrame(
    {'key': ['a', 'b', 'a', 'a', 'b', 'c'],
    'value': range(6)}
    )
right1 = pd.DataFrame(
    {'group_val': [3.5, 7]}, index=['a', 'b']
    )
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [29]:
right1

   group_val
a        3.5
b        7.0

In [31]:
pd.merge(left1, right1, left_on='key', right_index=True, how='innner')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

#### 轴向合并(pandas.concat)

对于pandas对象（如Series和DataFrame），带有标签的轴能够进一步推广数组的连接运算。但还需要考虑以下这些东西：
1. 如果对象在其它轴上的索引不同，我们应该合并这些轴的不同元素还是只使用交集？
2. 连接的数据集是否需要在结果对象中可识别？
3. 连接轴中保存的数据是否需要保留？许多情况下，DataFrame默认的整数标签最好在连接时删掉。

其主要参数如下：
- `objs`：需要连接的 DataFrame（或 Series）对象，可以是一个 list 或 dict。
- `axis`：合并的轴，0 表示按行合并，1 表示按列合并，默认为0。
- `join`：合并方式，'inner' 表示内连接，'outer' 表示外连接，默认为 'outer'。
- `ignore_index`：是否忽略原有的行索引或列索引，创建新的整数索引，默认为 False。
- `keys`：用于构建层次化索引的分组键，可以是多个，可以是任意可迭代类型，默认为 None。

##### 对于series来说

In [34]:
import pandas as pd
s1 = pd.Series([0, 1], index=['a', 'b'])
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])
s3 = pd.Series([5, 6], index=['f', 'g'])

In [35]:
# 默认按行进行拼接
pd.concat([s1, s2 ,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [36]:
# 按列进行拼接
pd.concat([s1, s2, s3], axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [50]:
# 可以指定要按照哪些索引进行合并,第一种方法已经废弃
# pd.concat([s1, s2, s3],axie=1, join_axes=['a','b'])
pd.concat([s1, s2, s3],axis=1).reindex(index=['a', 'c', 'd', 'e'])

     0    1   2
a  0.0  NaN NaN
c  NaN  2.0 NaN
d  NaN  3.0 NaN
e  NaN  4.0 NaN

In [38]:
# 但上述情况轴上的索引都没有重复，再创建一个series
s4 = pd.concat([s1, s3])
s4

a    0
b    1
f    5
g    6
dtype: int64

In [44]:
# join参数默认是outer
pd.concat([s1, s4], axis=1)

     0  1
a  0.0  0
b  1.0  1
f  NaN  5
g  NaN  6

In [48]:
pd.concat([s1, s4], axis=1, join='inner')

   0  1
a  0  0
b  1  1

In [42]:
# 按行合并时，重复的并不会被丢弃
pd.concat([s1, s4])

a    0
b    1
a    0
b    1
f    5
g    6
dtype: int64

In [57]:
# 上述数据可能会造成歧义，需要通过keys来建立层次化索引
pd.concat([s1, s4], keys=['one', 'two'])

one  a    0
     b    1
two  a    0
     b    1
     f    5
     g    6
dtype: int64

In [58]:
# 按列合并时，keys变为列名
pd.concat([s1, s4], axis=1, keys=['one', 'two'])

   one  two
a  0.0    0
b  1.0    1
f  NaN    5
g  NaN    6

##### 对于Dataframe来说

In [60]:
import pandas as pd
df1 = pd.DataFrame(
    np.arange(6).reshape(3, 2), 
    index=['a', 'b', 'c'],
    columns=['one', 'two']
    )
df2 = pd.DataFrame(
    5 + np.arange(6).reshape(2, 3), 
    index=['a', 'c'],
    columns=['three', 'four', 'five']
    )
df1

   one  two
a    0    1
b    2    3
c    4    5

In [61]:
df2

   three  four  five
a      5     6     7
c      8     9    10

In [66]:
# 按行
pd.concat([df1, df2], keys=['one', 'two'])

       one  two  three  four  five
one a  0.0  1.0    NaN   NaN   NaN
    b  2.0  3.0    NaN   NaN   NaN
    c  4.0  5.0    NaN   NaN   NaN
two a  NaN  NaN    5.0   6.0   7.0
    c  NaN  NaN    8.0   9.0  10.0

In [67]:
# 此时再设置keys则可认为设置了列的层次化索引
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'])

  level1     level2
     one two  three four  five
a      0   1    5.0  6.0   7.0
b      2   3    NaN  NaN   NaN
c      4   5    8.0  9.0  10.0

In [75]:
# 直接传入字典也可以
pd.concat({'level1':df1, 'level2':df2}, axis=1)

  level1     level2
     one two  three four  five
a      0   1    5.0  6.0   7.0
b      2   3    NaN  NaN   NaN
c      4   5    8.0  9.0  10.0

In [76]:
# 还可以继续对层次化索引进行命名
pd.concat([df1, df2], axis=1,
           keys=['level1', 'level2'],
           names=['level', 'number']
           )

level  level1     level2
number    one two  three four  five
a           0   1    5.0  6.0   7.0
b           2   3    NaN  NaN   NaN
c           4   5    8.0  9.0  10.0

In [77]:
# 忽略原有索引
pd.concat([df1, df2], axis=1,ignore_index=True)

   0  1    2    3     4
a  0  1  5.0  6.0   7.0
b  2  3  NaN  NaN   NaN
c  4  5  8.0  9.0  10.0

In [79]:
pd.concat([df1, df2], ignore_index=True)

   one  two  three  four  five
0  0.0  1.0    NaN   NaN   NaN
1  2.0  3.0    NaN   NaN   NaN
2  4.0  5.0    NaN   NaN   NaN
3  NaN  NaN    5.0   6.0   7.0
4  NaN  NaN    8.0   9.0  10.0

## 数据的汇总与描述统计

pandas对象拥有一组常用的数学和统计方法。它们大部分都属于约简和汇总统计，用于从Series中提取单个值（如sum或mean）或从DataFrame的行或列中提取一个Series。跟对应的NumPy数组方法相比，它们都是基于没有缺失数据的假设而构建的。

### 约简型

约简方法的常见参数有`axis`和`skipna`

其中默认按列进行计算，若设置`axis`值为`columns`或`1`，则会按行进行计算；`skipna`参数默认为`True`，表示忽略缺省值，可以设置为`False`

In [4]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    [[1.4, np.nan], [7.1, -4.5],
    [np.nan, np.nan], [0.75, -1.3]],
    index=['a', 'b', 'c', 'd'],
    columns=['one', 'two']
    )
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [46]:
# 求和,并返回一个series
df.sum()

one    9.25
two   -5.80
dtype: float64

In [6]:
# 提取相应信息
result1 = df.sum()['one']
result1
result2 = df['one'].sum()
result2

9.25

In [5]:
# 按行求和
df.sum(axis = 1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [8]:
# 不忽略缺省值会使得最后结果包含缺省值
df.sum(axis=1, skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

#### 求均值

mean函数除了axis和skipna两个参数外，还有`numeric_only`参数，表示只计算数值类型的数据。该参数的默认值为False，可以调整为True。

In [47]:
df.mean(numeric_only=True)

one    3.083333
two   -2.900000
dtype: float64

In [9]:
# 求最值
df.max()

one    7.1
two   -1.3
dtype: float64

In [10]:
df.min()

one    0.75
two   -4.50
dtype: float64

In [34]:
# 此外，最值还可以通过函数返回索引值来返回间接统计
# 返回索引值
df.idxmax()

one    b
two    d
dtype: object

In [14]:
# 求方差
df.var()

one    12.205833
two     5.120000
dtype: float64

In [18]:
# 求标准差
df.std()

one    3.493685
two    2.262742
dtype: float64

In [20]:
# 统计非缺省值的数量
df.count()

one    3
two    2
dtype: int64

In [21]:
# 求中位数
df.median()

one    1.4
two   -2.9
dtype: float64

In [24]:
# quantile(q)求分位数，其中q在0,1之间
df.quantile(0.6)

one    2.54
two   -2.58
Name: 0.6, dtype: float64

还有一些其他的约简函数，如`skew`求偏度，`kurt`求峰度，`diff`求一阶差分(时间序列常用)

### 累计型

累计型同样可以通过`axis`来控制方向

In [7]:
# 求累计和
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [31]:
# 求累计积
df.cumprod()

     one   two
a  1.400   NaN
b  9.940 -4.50
c    NaN   NaN
d  7.455  5.85

### 其他类型

#### describe

In [10]:
import pandas as pd
import numpy as np
df = pd.DataFrame(np.random.randn(1000, 4), columns=['one', 'two', 'three', 'four'])
df

          one       two     three      four
0    0.491472  0.627574 -0.696520  0.678354
1   -0.129542 -1.276804  1.514920  1.517262
2    0.840211  1.223123  1.506455 -0.198318
3    0.278496  1.399202  0.133467 -0.071339
4    1.156424 -0.561717  0.426510 -1.207078
..        ...       ...       ...       ...
995 -1.197903 -0.272612 -0.224894 -0.214471
996 -0.934248  0.500531 -1.424852 -0.419955
997  0.321263 -0.943910 -0.664656  0.222269
998 -0.657743 -1.099210  0.312889 -1.524680
999  0.028331  0.983182 -1.660842 -1.187986

[1000 rows x 4 columns]

In [11]:
df.describe()

               one          two        three         four
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.006961    -0.014370     0.005602     0.034015
std       0.974587     0.961878     1.001522     0.993322
min      -2.900920    -3.766478    -3.250295    -3.055100
25%      -0.659718    -0.713711    -0.679325    -0.640347
50%       0.008943    -0.028234    -0.009343     0.020868
75%       0.644985     0.583377     0.659190     0.654487
max       3.286489     3.200121     3.133504     3.067463

### 数据的分类统计与计算

#### 分组

##### 通过group by()函数操作


df.groupby()是Pandas中的一个功能强大的函数，用于按照某些标准对DataFrame进行分组操作。该函数接受一个或多个参数来定义分组规则和计算方法。以下是该函数的主要参数：
- `by`: 用于指定分组依据的列名、数组、Series或索引级别名称列表，可以是单个值或多个值。
- `axis`: 指定按行(0)或按列(1)进行分组，默认值为0。
- `level`: 如果轴是层次索引，则可以通过级别来指定分组。

按行分组将每一行看作一个整体，然后对每个分组应用聚合函数进行分析。按行分组通常用于在数据集中找到某些行之间的关系或共同点。按列分组是指将数据按照列索引进行分组，将每一列看作一个整体，然后对每个分组应用聚合函数进行分析。按列分组通常用于在数据集中找到某些列之间的关系或共同点。

In [8]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {'key1' : ['a', 'a', 'b', 'b', 'a'],
     'key2' : ['one', 'two', 'one', 'two', 'one'],
     'data1' : np.random.randn(5),
     'data2' : np.random.randn(5)}
     )
df

  key1 key2     data1     data2
0    a  one  2.035613 -0.004213
1    a  two  0.358225  1.221940
2    b  one  0.550934  0.167878
3    b  two -0.019242 -0.931777
4    a  one  0.501093  0.797869

In [3]:
# 进行分类,默认按行分组
grouped=df.groupby(by = df['key1'])
grouped

变量grouped是一个GroupBy对象。它实际上还没有进行任何计算，只是含有一些有关分组键df['key1']的中间数据而已。换句话说，该对象已经有了接下来对各分组执行运算所需的一切信息。可以将分组与约简函数的计算相结合。

In [5]:
# 在执行grouped1.mean()时，由于key2列不是数值数据, 俗称“麻烦列”。
# 所以需要加上参数numeric_only，只对数值型数据进行操作。
grouped.mean(numeric_only=True)

         data1     data2
key1
a    -1.132257  0.054576
b     0.630532  0.171460

In [9]:
# df['data1'].groupby(df['key1']是df.groupby(df['key1])['data1]的语法糖
grouped1 = df['data1'].groupby(by = df['key1'])

In [10]:
grouped1.mean()

key1
a    0.964977
b    0.265846
Name: data1, dtype: float64

In [4]:
grouped2 = df.groupby(by = [df['key1'], df['key2']])
grouped2

In [6]:
# 形成了层次化索引
grouped2.mean(numeric_only=True)

              data1     data2
key1 key2
a    one  -0.182916 -0.087722
     two  -0.985023  0.009240
b    one   0.216779  0.645870
     two   0.478377 -1.848818

In [23]:
df['data2'].groupby(by = [df['key1'], df['key2']]).mean()

key1  key2
a     one     0.396828
      two     1.221940
b     one     0.167878
      two    -0.931777
Name: data2, dtype: float64

In [25]:
import pandas as pd
import numpy as np

arrays = [['bar', 'bar', 'baz', 'baz', 'foo', 'foo'],
          ['one', 'two', 'one', 'two', 'one', 'two']]
index = pd.MultiIndex.from_arrays(arrays, names=('first', 'second'))

df = pd.DataFrame(np.random.randn(6, 3), index=index, columns=['A', 'B', 'C'])

df

                     A         B         C
first second
bar   one     0.023714 -1.265134 -1.281088
      two     2.231948  0.713613  1.557407
baz   one     0.567963  1.211745  1.812705
      two    -1.505732 -0.759963 -1.416629
foo   one    -0.514635  1.773300  0.826621
      two    -0.185320 -2.416303  0.134695

In [26]:
# 对于具有层次化索引的数据集，可以通过指定level参数来确定分类依据
df.groupby(level = 'first', axis = 0).mean()

              A         B         C
first
bar    1.127831 -0.275761  0.138160
baz   -0.468885  0.225891  0.198038
foo   -0.349977 -0.321502  0.480658

In [27]:
df.groupby(level = 'second', axis = 0).mean()

               A         B         C
second
one     0.025681  0.573304  0.452746
two     0.180299 -0.820885  0.091824

可以通过传递字典或series实现分组

In [16]:
people = pd.DataFrame(
    np.random.randn(5, 5),
    columns=['a', 'b', 'c', 'd', 'e'],
    index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis']
    )
people.iloc[[2, 3], [1, 2]] = np.nan
people

               a         b         c         d         e
Joe     1.347988  1.179852 -0.717709 -1.762232 -2.139456
Steve   2.586001 -1.140498 -1.809182  0.704597  0.685226
Wes     0.421631       NaN       NaN -0.139956  0.634283
Jim    -1.806666       NaN       NaN -1.777353 -0.147117
Travis  1.338916 -0.586978  0.816000  0.335949 -1.633338

In [24]:
mapping = {
    'a': 'red', 'b': 'red', 'c': 'blue',
    'd': 'blue', 'e': 'red', 'f' : 'orange'
    }

# 将这个字典传给groupby，来构造数组，且必须通过列进行分组
people.groupby(by = mapping, axis = 1).mean()

            blue       red
Joe    -1.239971  0.129462
Steve  -0.552293  0.710243
Wes    -0.139956  0.527957
Jim    -1.777353 -0.976892
Travis  0.575974 -0.293800

In [22]:
import pandas as pd
map_series = pd.Series(['red', 'red', 'blue', 'blue', 'red'],
                        index = ['a', 'b', 'c', 'd', 'e']
                    )
people.groupby(map_series, axis = 1).mean()

            blue       red
Joe    -1.239971  0.129462
Steve  -0.552293  0.710243
Wes    -0.139956  0.527957
Jim    -1.777353 -0.976892
Travis  0.575974 -0.293800

可以通过函数进行分组

In [28]:
people.groupby(len).mean()

          a         b         c         d         e
3 -0.012349  1.179852 -0.717709 -1.226514 -0.550763
5  2.586001 -1.140498 -1.809182  0.704597  0.685226
6  1.338916 -0.586978  0.816000  0.335949 -1.633338

#### 数据聚合运算

### 相关系数与协方差

## 读写文本格式的数据

### 读取Excel文件

In [ ]:
import pandas as pd
data = pd.read_excel()

其中有几个参数：
- `FilePath`：文件路径
- `sheet_name`：表单名
- `header`：默认为0，即将第一行视为列名。设置为None表示没有列名
- `usecols`：指定一些列进行读取